# 데이터사이언스 (0010085001)

## Exercise 4: Libraries for Data Science (Pandas)

In this excercise, we will cover Pandas library

In [3]:
import numpy as np
import pandas as pd

### Series

In [14]:
# Create a Series with [1, "John", 3.5, "Hey"]
obj = pd.Series([1, "John", 3.5, "Hey"])

print(obj)
print(obj.values)

0       1
1    John
2     3.5
3     Hey
dtype: object
[1 'John' 3.5 'Hey']

In [15]:
# Create a Series with [1, "John", 3.5, "Hey"]
# Indexing with ["a", "b", "c", "d"]

index = ["a", "b", "c", "d"]
obj2 = pd.Series([1, "John", 3.5, "Hey"], index=index)

print(obj2)
print(obj2["b"])
print(obj2.index)

a       1
b    John
c     3.5
d     Hey
dtype: object
John
Index(['a', 'b', 'c', 'd'], dtype='object')

In [16]:
# Create a Series with dictionary, {"Jane": 90, "Bill": 80, "Elon": 85,"Tom": 75, "Tim": 95}
score = {"Jane": 90, "Bill": 80, "Elon": 85,"Tom": 75, "Tim": 95}

# Convert the given dictionary to Series
names = pd.Series(score)

print(names)
print(names["Tim"])

Jane    90
Bill    80
Elon    85
Tom     75
Tim     95
dtype: int64
95

In [17]:
# Print data, a score is higher than 85
print(names[names > 85])

Jane    90
Tim     95
dtype: int64

In [18]:
# Change a score of Tom with 60
names["Tom"] = 60
print(names)

Jane    90
Bill    80
Elon    85
Tom     60
Tim     95
dtype: int64

In [19]:
# Change a score of whom is lower than 80 to 83
names[names < 80] = 83
print(names)

Jane    90
Bill    80
Elon    85
Tom     83
Tim     95
dtype: int64

### DataFrame

In [27]:
data={"name": ["Bill", "Tom", "Tim", "John", "Alex", "Vanessa", "Kate"],      
      "score": [90, 80, 85, 75, 95, 60, 65],      
      "sport": ["Wrestling", "Football", "Skiing", "Swimming", "Tennis",
               "Karete", "Surfing"],      
      "sex":["M", "M", "M", "M", "F", "F", "F"]}

In [28]:
# Create a DataFrame using the given data
df = pd.DataFrame(data)
print(df)

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [29]:
# Create a DataFrame with explicit index, ["name", "sport", "sex", "score"]
df = pd.DataFrame(data, columns=["name", "sport", "sex", "score"])
print(df)

      name      sport sex  score
0     Bill  Wrestling   M     90
1      Tom   Football   M     80
2      Tim     Skiing   M     85
3     John   Swimming   M     75
4     Alex     Tennis   F     95
5  Vanessa     Karete   F     60
6     Kate    Surfing   F     65

In [30]:
# Print the first five rows
print(df.head())

   name      sport sex  score
0  Bill  Wrestling   M     90
1   Tom   Football   M     80
2   Tim     Skiing   M     85
3  John   Swimming   M     75
4  Alex     Tennis   F     95

In [31]:
# Print the last five rows
print(df.tail(3))

      name    sport sex  score
4     Alex   Tennis   F     95
5  Vanessa   Karete   F     60
6     Kate  Surfing   F     65

In [33]:
# Append gender and age column on the given data
df = pd.DataFrame(data, columns=["name", "sport", "sex", "score", "gender", "age"])
print(df)

      name      sport sex  score gender  age
0     Bill  Wrestling   M     90    NaN  NaN
1      Tom   Football   M     80    NaN  NaN
2      Tim     Skiing   M     85    NaN  NaN
3     John   Swimming   M     75    NaN  NaN
4     Alex     Tennis   F     95    NaN  NaN
5  Vanessa     Karete   F     60    NaN  NaN
6     Kate    Surfing   F     65    NaN  NaN

In [34]:
# Append gender column on the given data and 
# designate the index as ["one", "two", "three", "four", "five", "six", "seven"]

index = ["one", "two", "three", "four", "five", "six", "seven"]
df = pd.DataFrame(data, columns=["name", "sport", "sex", "score", "gender", "age"], index=index)

print(df)

          name      sport sex  score gender  age
one       Bill  Wrestling   M     90    NaN  NaN
two        Tom   Football   M     80    NaN  NaN
three      Tim     Skiing   M     85    NaN  NaN
four      John   Swimming   M     75    NaN  NaN
five      Alex     Tennis   F     95    NaN  NaN
six    Vanessa     Karete   F     60    NaN  NaN
seven     Kate    Surfing   F     65    NaN  NaN

In [35]:
# Print the column where its name is sport.
print(df["sport"])

one      Wrestling
two       Football
three       Skiing
four      Swimming
five        Tennis
six         Karete
seven      Surfing
Name: sport, dtype: object

In [36]:
# Define name and sport columns with my_columns
# Print the column using my_columns
my_columns = ["name", "sport"]
print(df[my_columns])

          name      sport
one       Bill  Wrestling
two        Tom   Football
three      Tim     Skiing
four      John   Swimming
five      Alex     Tennis
six    Vanessa     Karete
seven     Kate    Surfing

In [37]:
# Fill the age column with values [18, 19, 20, 18, 17, 17, 18]
values = [18, 19, 20, 18, 17, 17, 18]
df["age"] = values
print(df)

          name      sport sex  score gender  age
one       Bill  Wrestling   M     90    NaN   18
two        Tom   Football   M     80    NaN   19
three      Tim     Skiing   M     85    NaN   20
four      John   Swimming   M     75    NaN   18
five      Alex     Tennis   F     95    NaN   17
six    Vanessa     Karete   F     60    NaN   17
seven     Kate    Surfing   F     65    NaN   18

In [40]:
# Make the pass column (boolean)
# If the score is greather than or equal 70, assign True 
df["pass"] = df["score"]>=70
print(df)

          name      sport sex  score gender  age   pass
one       Bill  Wrestling   M     90    NaN   18   True
two        Tom   Football   M     80    NaN   19   True
three      Tim     Skiing   M     85    NaN   20   True
four      John   Swimming   M     75    NaN   18   True
five      Alex     Tennis   F     95    NaN   17   True
six    Vanessa     Karete   F     60    NaN   17  False
seven     Kate    Surfing   F     65    NaN   18  False

### Basic Functions
* Summarizing & Computing Descriptive Statistics

In [43]:
# Create 4 by 2 DataFrame with [[2.4, np.nan], [6.3, -5.4], [np.nan, np.nan], and [0.75, -1.3]]
# Set index name as ["a", "b", "c", "d"] and column names as ["one", "two"]
df = pd.DataFrame(
    data=[[2.4, np.nan], [6.3, -5.4], [np.nan, np.nan], [0.75, -1.3]],
    index=["a", "b", "c", "d"],
    columns=["one", "two"]
)

print(df)

    one  two
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [44]:
# Return the sum of the values over the axis
df.sum()

one    9.45
two   -6.70
dtype: float64

In [45]:
# Return the sum of the values over the axis=1
df.sum(axis=1)

a    2.40
b    0.90
c    0.00
d   -0.55
dtype: float64

In [46]:
# Return the mean of the values over the axis
df.mean(axis=1)

a    2.400
b    0.450
c      NaN
d   -0.275
dtype: float64

In [52]:
# Return index of first occurrence of maximum over the axis
df.idxmax()

one    b
two    d
dtype: object

In [53]:
# Return index of first occurrence of minimum over the axis
df.idxmin()

one    d
two    b
dtype: object

In [54]:
# Return cumulative sum over a DataFrame or Series axis
df.cumsum()

    one  two
a  2.40  NaN
b  8.70 -5.4
c   NaN  NaN
d  9.45 -6.7

In [55]:
# Generate descriptive statistics
df.describe()

         one       two
count  3.000  2.000000
mean   3.150 -3.350000
std    2.850  2.899138
min    0.750 -5.400000
25%    1.575 -4.375000
50%    2.400 -3.350000
75%    4.350 -2.325000
max    6.300 -1.300000

### Indexing & selection & Filtering in Pandas
* DataFrame indexing

In [57]:
# Make a DataFrame with 16 consecutive integers of size (4, 4) starting at 0
# Set the index as ["London", "Paris", "Berlin", "Istanbul"]
# Set the column as ["one", "two", "three", "four"]
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London", "Paris", "Berlin", "Istanbul"],
    columns=["one", "two", "three", "four"])

print(data)

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [59]:
# Print the second column data
print(data["two"])

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int64

In [63]:
# Print the second and third columns data

my_columns = ["two", "three"]
print(data[my_columns])

          two  three
London      1      2
Paris       5      6
Berlin      9     10
Istanbul   13     14

In [67]:
# Print rows that the value of last column is greater than 5

print(data[data["four"] > 5])

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [68]:
# Change the value where each data is smaller than 5

data[data < 5] = 0
print(data)

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

* Selecting with iloc and loc

In [70]:
# Print the rows with index 1
data.iloc[1]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int64

In [80]:
# Print the data with row index with 1 and column index with [1, 2, 3]

index = [1, 2, 3]
data.iloc[1, index]

two      5
three    6
four     7
Name: Paris, dtype: int64

In [72]:
# Print the data with row index with [1, 3] and column index with [1, 2, 3]

row_index = [1, 3]
col_index = [1, 2, 3]
data.iloc[row_index, col_index]

          two  three  four
Paris       5      6     7
Istanbul   13     14    15

In [81]:
# Print the data with Paris row and ["one","two"] columns
col_index = ["one", "two"]
data.loc["Paris", col_index]

one    0
two    5
Name: Paris, dtype: int64

### Combininig & Merging Datasets in Pandas
* Joining DataFrame

In [92]:
# Create the DataFrame called d1
# key1: ["a", "b", "c", "c", "d", "e"]
# num1: [0, 1, 2, 3, 4, 5]
d1 = pd.DataFrame(
    {
        "key1" : ["a", "b", "c", "c", "d", "e"],
        "num1": [0, 1, 2, 3, 4, 5]
    }
)

# Create the DataFrame called d2
# key1: ["b", "c", "e", "f"]
# num2: [0, 1, 2, 3]
d2 = pd.DataFrame(
    {
        "key1" : ["b", "c", "e", "f"],
        "num2": [0, 1, 2, 3]
    }
)

print(d1)
print(d2)

  key1  num1
0    a     0
1    b     1
2    c     2
3    c     3
4    d     4
5    e     5
  key1  num2
0    b     0
1    c     1
2    e     2
3    f     3

In [93]:
pd.merge(d1, d2) # 공통된 column(key1)이 있어야 merge가 된다. -> 공통적인 key1값을 가져온다

  key1  num1  num2
0    b     1     0
1    c     2     1
2    c     3     1
3    e     5     2

In [89]:
pd.merge(d1, d2, on='key1')

  key1  num1  num2
0    b     1     0
1    c     2     1
2    c     3     1
3    e     5     2

In [95]:
# Create the DataFrame called d3
# key1: ["a", "b", "c", "c", "d", "e"]
# num1: [0, 1, 2, 3, 4, 5]
d3 = pd.DataFrame(
    {
        "key1" : ["a", "b", "c", "c", "d", "e"],
        "num1": [0, 1, 2, 3, 4, 5]
    }
)

# Create the DataFrame called d4
# key2: ["b", "c", "e", "f"]
# num2: [0, 1, 2, 3]
d4 = pd.DataFrame(
    {
        "key2" : ["b", "c", "e", "f"],
        "num2": [0, 1, 2, 3]
    }
)

print(d3)
print(d4)

  key1  num1
0    a     0
1    b     1
2    c     2
3    c     3
4    d     4
5    e     5
  key2  num2
0    b     0
1    c     1
2    e     2
3    f     3

In [98]:
pd.merge(d3, d4, left_on="key1", right_on="key2")

  key1  num1 key2  num2
0    b     1    b     0
1    c     2    c     1
2    c     3    c     1
3    e     5    e     2

In [99]:
pd.merge(d1,d2,how="outer") # 합집합

  key1  num1  num2
0    a   0.0   NaN
1    b   1.0   0.0
2    c   2.0   1.0
3    c   3.0   1.0
4    d   4.0   NaN
5    e   5.0   2.0
6    f   NaN   3.0

In [100]:
pd.merge(d1,d2,how="left") # 왼쪽 데이터 프레임 기준으로 왼쪽에 맞춰 합치기

# num1 column에 nan이 없게끔 합치기

  key1  num1  num2
0    a     0   NaN
1    b     1   0.0
2    c     2   1.0
3    c     3   1.0
4    d     4   NaN
5    e     5   2.0

In [101]:
pd.merge(d1,d2,how="right") # 오른쪽 데이터 프레임 기준으로 오른쪽에 맞춰 합치기

# num2 column에 nan이 없게끔 합치기

  key1  num1  num2
0    b   1.0     0
1    c   2.0     1
2    c   3.0     1
3    e   5.0     2
4    f   NaN     3

In [102]:
pd.merge(d1, d2, how='inner') # 교집합

  key1  num1  num2
0    b     1     0
1    c     2     1
2    c     3     1
3    e     5     2

### Missing Data in Pandas

In [104]:
from numpy import nan as NA

# Create a 3 by 3DataFrame with [[1,2,3],[4,NA,5],[NA,NA,NA]]
df = pd.DataFrame([
    [1,2,3],[4,NA,5],[NA,NA,NA]
])

print(df)

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [106]:
print(df.isna())

       0      1      2
0  False  False  False
1  False   True  False
2   True   True   True

In [105]:
# Remove rows containing NaN values
print(df.dropna())  # default : any -> nan 하나라도 있으면 drop

     0    1    2
0  1.0  2.0  3.0

In [107]:
# Remove rows containing NaN values when all the values are NaN
print(df.dropna(how="all")) # all -> 모두 nan이어야 drop

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [109]:
# Fill NA values
# NA in the first column with 15
# NA in the first column with 25
# NA in the first column with 35
print(df.fillna({0:15,1:25,2:35}))

      0     1     2
0   1.0   2.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0